config.org

Note: None of this code is mine
most of this code has been taken from [[https://tecosaur.github.io/emacs-config/config.html][tecosaur doom emacs config]]
*  Basic config

#+begin_src elisp

;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!


;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "max12525k"
      user-mail-address "62839496+max12525k@users.noreply.github.com")

;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "Fira Code" :size 18 :weight 'semi-light)
      ;; doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
(setq doom-theme 'doom-vibrant)

;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/org/")

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.
(setq display-line-numbers-type 'relative)


;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.
(with-eval-after-load 'typescript-mode (add-hook 'typescript-mode-hook #'lsp))

#+end_src

#+RESULTS:

* Important config:
** Set cool fonts

#+begin_src elisp
(setq doom-font (font-spec :family "JetBrains Mono" :size 24)
     doom-big-font (font-spec :family "JetBrains Mono" :size 34)
     doom-variable-pitch-font (font-spec :family "Overpass" :size 24)
     doom-unicode-font (font-spec :family "JuliaMono")
     doom-serif-font (font-spec :family "IBM Plex Mono" :weight 'light))

#+end_src

#+RESULTS:
: #<font-spec nil nil IBM\ Plex\ Mono nil nil light nil nil nil nil nil nil nil>

** Ensure fonts available on system

#+begin_src elisp
(defvar required-fonts '("JetBrainsMono.*" "Overpass" "JuliaMono" "IBM Plex Mono" "Merriweather" "Alegreya"))

(defvar available-fonts
  (delete-dups (or (font-family-list)
                   (split-string (shell-command-to-string "fc-list : family")
                                 "[,\n]"))))

(defvar missing-fonts
  (delq nil (mapcar
             (lambda (font)
               (unless (delq nil (mapcar (lambda (f)
                                           (string-match-p (format "^%s$" font) f))
                                         available-fonts))
                 font))
             required-fonts)))


(if missing-fonts
    (pp-to-string
     `(unless noninteractive
        (add-hook! 'doom-init-ui-hook
          (run-at-time nil nil
                       (lambda ()
                         (message "%s missing the following fonts: %s"
                                  (propertize "Warning!" 'face '(bold warning))
                                  (mapconcat (lambda (font)
                                               (propertize font 'face 'font-lock-variable-name-face))
                                             ',missing-fonts
                                             ", "))
                         (sleep-for 1))))))
  ";; No missing fonts detected")

#+end_src
* Advance Config:

** Open Full Screen

#+begin_src elisp
(add-to-list 'default-frame-alist '(fullscreen . maximized) )
#+end_src

** Fix annoying lose of highlight

#+begin_src elisp
(after! web-mode
  (defun msc/save-and-revert-buffer ()
    (interactive)
    (call-interactively 'save-buffer)
    (msc/revert-buffer-noconfirm))

  (map! :mode web-mode-map :leader "j" 'msc/save-and-revert-buffer))
#+end_src

** Lets get LSP in src block

#+begin_src elisp
(cl-defmacro lsp-org-babel-enable (lang)
  "Support LANG in org source code block."
  (setq centaur-lsp 'lsp-mode)
  (cl-check-type lang stringp)
  (let* ((edit-pre (intern (format "org-babel-edit-prep:%s" lang)))
         (intern-pre (intern (format "lsp--%s" (symbol-name edit-pre)))))
    `(progn
       (defun ,intern-pre (info)
         (let ((file-name (->> info caddr (alist-get :file))))
           (unless file-name
             (setq file-name (make-temp-file "babel-lsp-")))
           (setq buffer-file-name file-name)
           (lsp-deferred)))
       (put ',intern-pre 'function-documentation
            (format "Enable lsp-mode in the buffer of org source block (%s)."
                    (upcase ,lang)))
       (if (fboundp ',edit-pre)
           (advice-add ',edit-pre :after ',intern-pre)
         (progn
           (defun ,edit-pre (info)
             (,intern-pre info))
           (put ',edit-pre 'function-documentation
                (format "Prepare local buffer environment for org source block (%s)."
                        (upcase ,lang))))))))
(defvar org-babel-lang-list
  '("go" "python" "ipython" "bash" "sh" "jupyter-python"))
(dolist (lang org-babel-lang-list)
  (eval `(lsp-org-babel-enable ,lang)))


#+end_src



** lets enable gitlens features in emacs

#+begin_src elisp
(setq magit-revision-show-gravatars '("^Author:     " . "^Commit:     "))


#+end_src

#+RESULTS:
: (^Author:      . ^Commit:     )

: TODO add more configuration for doom

** lets make doom more beautiful

#+begin_src elisp
(remove-hook 'window-setup-hook #'doom-init-theme-h)
(add-hook 'after-init-hook #'doom-init-theme-h 'append)
(delq! t custom-theme-load-path)
(custom-set-faces!
  '(doom-modeline-buffer-modified :foreground "orange"))


#+end_src

#+RESULTS:
| doom--customize-themes-h-42 |


**  better buffer names

#+begin_src elisp
(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")

#+end_src

#+RESULTS:
: ► Doom

** Company Improvement

#+begin_src elisp
(after! company
  (setq company-idle-delay 0.5
        company-minimum-prefix-length 2)
  (setq company-show-quick-access t)
  (add-hook 'evil-normal-state-entry-hook #'company-abort))

(setq-default history-length 1000)
(setq-default prescient-history-length 1000)
#+end_src

#+RESULTS:
: 1000

** resume ignore and noexport enable
#+begin_src elisp
(after! org
  (use-package! ox-extra
    :config
    (ox-extras-activate '(latex-header-blocks ignore-headlines))))

#+end_src

#+RESULTS:
: t

** Github Copilot configuration
#+begin_src elisp
(use-package! copilot
  :hook (prog-mode . copilot-mode)
  :bind (("C-TAB" . 'copilot-accept-completion-by-word)
         ("C-<tab>" . 'copilot-accept-completion-by-word)
         :map copilot-completion-map
         ("<tab>" . 'copilot-accept-completion)
         ("TAB" . 'copilot-accept-completion)))
#+end_src

#+RESULTS:

** UV
#+begin_src elisp
(use-package! uv-mode
  :hook (python-mode . uv-auto-activate-hook))
#+end_src

#+RESULTS:
| uv-auto-activate-hook | doom-modeline-env-setup-python | doom--enable-+web-django-mode-in-python-mode-h | pipenv-mode |

** Org-auto-tangle

#+begin_src elisp
(use-package! org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode)
  :config
  (setq org-auto-tangle-default t))

#+end_src

#+RESULTS:

** add awesome-cv
#+begin_src elisp

; after org
(use-package! ox-awesomecv
  :after org)

#+end_src

** rust analyser
#+begin_src elisp
(after! lsp-rust
  (setq lsp-rust-server 'rust-analyzer))
#+end_src
